app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.get_ratings
    #@selected_ratings = []
    if params[:ratings] then
        @selected_ratings = params[:ratings].keys
        session[:selected_ratings] = @selected_ratings
    elsif params[:commit] then
	@selected_ratings = @all_ratings
	session[:selected_ratings] = []
    else
        @selected_ratings = @all_ratings
	if !session[:selected_ratings] or session[:selected_ratings].length == 0 then
	    session[:selected_ratings] = []
	else
	    @selected_ratings = session[:selected_ratings]
	end
    end
    #puts session[:selected_ratings]
    if !params[:sort_header] then
	#@highlight_title = false
	#@highlight_release_date = false
        @movies = Movie.where(:rating => @selected_ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R', 'PG-13', 'PG') ORDER BY release_date